---
title: DirectShapeReferenceOptions
classe: Autodesk.Revit.DB.DirectShapeReferenceOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DirectShapeReferenceOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `directShapeReferenceOptions.IsValidObject` | Boolean |
| `String Name { get; set; }` | `directShapeReferenceOptions.Name` | String |
| `Void Dispose()` | `directShapeReferenceOptions.Dispose()` | Void |
| `ExternalGeometryId GetExternalGeometryId()` | `directShapeReferenceOptions.GetExternalGeometryId()` | ExternalGeometryId |
| `Boolean IsValidExternalGeometryId(ExternalGeometryId)` | `DirectShapeReferenceOptions.IsValidExternalGeometryId(externalId)` | Boolean |
| `Boolean IsValidReferenceName(String)` | `DirectShapeReferenceOptions.IsValidReferenceName(name)` | Boolean |
| `DirectShapeReferenceOptions SetExternalGeometryId(ExternalGeometryId)` | `directShapeReferenceOptions.SetExternalGeometryId(externalId)` | DirectShapeReferenceOptions |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```